In [121]:
import pandas as pd
import numpy as np

##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [122]:
# titanic.csv 파일 로드
datat = pd.read_csv('./data/titanic.csv')
# titanic 데이터셋의 메타 데이터 확인
datat

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [123]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
a = datat[datat['Survived'] == 0]['Survived'].count()
b = datat[datat['Survived'] == 1]['Survived'].count()
print(f'생존자의 수: {a}명, 사망자의 수: {b}명')

생존자의 수: 549명, 사망자의 수: 342명

In [124]:
# 2. 승객 나이의 평균 출력
age_mean = datat['Age'].mean()
print(f'평균 {age_mean}세')

평균 29.69911764705882세

In [125]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
class_top = datat[datat['Pclass'] == 1]['Fare'].max()
class_name = datat[datat['Fare'] == class_top]['Name']
print(class_name)

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [126]:
# 4. 여성 승객의 수를 구하여 출력
sex_count = datat[datat['Sex'] == 'female']['Sex'].count()
print(f'{sex_count}명')

314명

In [127]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
fare_50 = datat[datat['Fare'] >= 50][['Name','Fare']]
print(fare_50)

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [128]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
age_18 = datat[datat['Age'] < 18]['Survived'].mean()
print(age_18)

0.5398230088495575

In [129]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
class_2 = datat[datat['Pclass'] == 2]['Fare'].mean()
print(class_2)

20.662183152173913

In [130]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
top_age = datat['Age'].max()
top_age_p = datat[datat['Age'] == top_age][['Age', 'Name']]
print(top_age_p)

      Age                                  Name
630  80.0  Barkworth, Mr. Algernon Henry Wilson

In [131]:
# 9. S 항구에서 탑승한 승객의 수를 출력
s_port = datat[datat['Embarked'] == 'S']['PassengerId'].count()
print(s_port)

644

In [132]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
male_3 = datat[(datat['Pclass'] == 3) & (datat['Sex'] == 'male') & (datat['Survived'] == 1)]['Survived'].count()
print(male_3)

47

- 고급문제

In [133]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
groupby_p = datat.groupby(['Pclass','Survived'])
p_g = groupby_p['Age'].mean()
print(p_g)

Pclass  Survived
1       0           43.695312
        1           35.368197
2       0           33.544444
        1           25.901566
3       0           26.555556
        1           20.646118
Name: Age, dtype: float64

In [134]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
s_35 = datat[datat['SibSp'] >= 3].sort_values('Fare')[::-1]
s_35_t = s_35[['Name','Age']][-5:]
print(s_35_t)

                                                  Name   Age
374                         Palsson, Miss. Stina Viola   3.0
24                       Palsson, Miss. Torborg Danira   8.0
726        Renouf, Mrs. Peter Henry (Lillian Jefferys)  30.0
85   Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...  33.0
68                     Andersson, Miss. Erna Alexandra  17.0

In [135]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
is_null = datat[datat['Age'].isnull()]['Embarked'].value_counts()
print(is_null)

Embarked
S    90
Q    49
C    38
Name: count, dtype: int64

In [136]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

data_4 = datat[(datat['Age'] < 16) & (datat['SibSp'] == 0) & (datat['Parch'] == 0)][['Name','Sex','Survived']]
print(data_4)

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [137]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
data_5 = datat[(datat['Pclass'] == 1) & (datat['Fare'] > datat['Fare'].mean())][['Name','Age','Fare']]
print(data_5)

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [138]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
data_APF = datat[datat[['Age','Pclass','Fare']].notnull()]
groupby_6 = data_APF.groupby('Pclass')
data_m = groupby_6['Fare'].mean()
data_me = groupby_6['Fare'].median()

print(f'등급별 평균 운임: {data_m}, 등급별 중앙값 운임: {data_me}')

등급별 평균 운임: Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64, 등급별 중앙값 운임: Pclass
1    60.2875
2    14.2500
3     8.0500
Name: Fare, dtype: float64

In [139]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
#datat[datat['Embarked']]['Age'].mean()
data_top = datat['Embarked'].value_counts().idxmax()
data_72 = datat[datat['Embarked'] == data_top]['Survived'].mean()
print(data_72)

0.33695652173913043

In [140]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력
data_8 = datat[(datat['Sex'] == 'female') & (datat['Age'] >= 30)]['Survived'].mean()
print(data_8)

0.8070175438596491

In [141]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력
data_9 = datat[(datat['SibSp'] + datat['Parch']) >= 3]['Survived'].mean()
print(data_9)

0.34065934065934067

In [ ]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
dat_10 = datat[datat['Cabin'].notnull()]
data_10 = dat_10.groupby('Pclass')['Survived'].mean()
print(data_10)

Pclass
1    0.664773
2    0.812500
3    0.500000
Name: Survived, dtype: float64